#include <stdio.h>
int main()
{
    double s,i,bon1,bon2,bon4,bon6,bon10 ;
    bon1=100000*0.1 ;                 /*利润为10万元时的奖金*/
    bon2=bon1+100000*0.075 ;          /*利润为20万元时的奖金*/
    bon4=bon2+200000*0.05 ;           /*利润为40万元时的奖金*/
    bon6=bon4+200000*0.03 ;           /*利润为60万元时的奖金*/
    bon10=bon6+400000*0.015 ;         /*利润为100万元时的奖金*/
    printf ("利润是:\n") ;
    scanf ("%lf",&i) ;
    if (i>=0&&i<=100000)
    s=i*0.1 ;
    if (i>100000&&i<=200000)
    s=bon1+(i-100000)*0.075 ;
    if (i>200000&&i<=400000)
    s=bon2+(i-200000)*0.05 ;
    if (i>400000&&i<=600000)
    s=bon4+(i-400000)*0.03 ;
    if (i>600000&&i<=1000000)
    s=bon6+(i-600000)*0.015 ;
    if (i>1000000)
    s=bon10+(i-1000000)*0.01 ;
    printf ("应发奖金总是=%lf",s) ;
    return 0 ;
}
